betfair/templates/global/BFGlobalService.modifyProfile.req.xml

<?xmlversion='1.0'encoding='UTF-8'?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
xmlns:SOAP-ENC='http://schemas.xmlsoap.org/soap/encoding/'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:ns2='http://www.betfair.com/publicapi/types/global/v3/'
xmlns:ns1='http://www.betfair.com/publicapi/v3/BFGlobalService/'>
<SOAP-ENV:Body>
<ns1:modifyProfile>
<ns1:request>
<header>
<sessionToken></sessionToken>
</header>
<password></password>
<address1></address1>
<address2></address2>
<address3></address3>
<townCity></townCity>
<countyState></countyState>
<postCode></postCode>
<countryOfResidence></countryOfResidence>
<homeTelephone></homeTelephone>
<workTelephone></workTelephone>
<mobileTelephone></mobileTelephone>
<emailAddress></emailAddress>
<timeZone></timeZone>
<depositLimit>0</depositLimit>
<depositLimitFrequency>DAILY</depositLimitFrequency>
<lossLimit>0</lossLimit>
<lossLimitFrequency>DAILY</lossLimitFrequency>
<nationalIdentifier></nationalIdentifier>
<header>
<clientStamp>0</clientStamp>
<sessionToken></sessionToken>
</header>
</ns1:request>
</ns1:modifyProfile>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
